Revit 2027 API
IFCExtrusionCalculatorOptions.Scale Property
 The scaling factor for length measurements from the default Revit units to the export units.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Scale { get; set; }
Public Property Scale As Double
	Get
	Set
public:
property double Scale {
	double get ();
	void set (double value);
}
member Scale : float with get, set
Property Value
Double
See Also
Reference
IFCExtrusionCalculatorOptions Class
Autodesk.Revit.DB.IFC Namespace